app/controllers/api/presentations_controller.rb

SELECT "presentations".* FROM "presentations"
---
  def index
    @presentations = Presentation.all

SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_presentation
    @presentation = Presentation.find(params[:id])