app/controllers/presentations_controller.rb

SELECT "presentations".* FROM "presentations"
---
  def index
    @presentations = Presentation.all

INSERT INTO "presentations" ("presen_date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["presen_date", "2020-12-19"], ["created_at", "2020-12-19 21:53:45.434466"], ["updated_at", "2020-12-19 21:53:45.434466"]]
---
  def create
    @presentation = Presentation.new(presentation_params)
    if @presentation.save

UPDATE "presentations" SET "title" = $1, "presen_date" = $2, "user" = $3, "document_path" = $4, "updated_at" = $5 WHERE "presentations"."id" = $6  [["title", "osake"], ["presen_date", "2020-12-20"], ["user", 0], ["document_path", "path"], ["updated_at", "2020-12-19 22:53:46.329845"], ["id", 2]]
---
  def update
    if @presentation.update(presentation_params)

DELETE FROM "presentations" WHERE "presentations"."id" = $1  [["id", 2]]
---
  def destroy
    @presentation.destroy

SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_presentation
    @presentation = Presentation.find(params[:id])